{
    "results": [
        [
            "5bcafde29600021147742e3a",
            "LEW-TOPS-125",
            "Aircraft <span class=\"highlight\">Engine<\/span> Icing Event Avoidance and Mitigation",
            "Innovators at NASA's Glenn Research Center have developed a new means of avoiding and mitigating icing events for aircraft flying above 14,000 feet, dramatically improving aviation safety and reducing operating costs. Often undetectable with current radar, ice crystals in convective storm cells can produce a phenomenon referred to as \"Ice Crystal Icing,\" in which ice accumulates, or accretes, in turbofan engines. Ice-crystal accretion can cause serious <span class=\"highlight\">engine<\/span> operational problems and sometimes even catastrophic <span class=\"highlight\">engine<\/span> failures. Using a combination of sensors, <span class=\"highlight\">engine<\/span> system modeling, and compressor flow analysis code, Glenn's innovation performs real-time analysis to determine the potential of ice accretion. This analysis allows pilots to avoid potential icing while using a more direct route than would otherwise be possible. Thus, Glenn's system reduces fuel consumption and <span class=\"highlight\">engine<\/span> wear while fulfilling the crucial objective of increasing aircraft safety.",
            "LEW-TOPS-125",
            "aeronautics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-125\/iStock-157730835_LEW-19309-1_airplane-storm_1388x1050-300dpi.jpg",
            "",
            15.867758
        ],
        [
            "59fa10809600022a4d1c7751",
            "LAR-TOPS-185",
            "Turbofan <span class=\"highlight\">Engine<\/span> Acoustic Liner Design and Analysis Tools",
            "NASA Langley Research Center has developed two tools for turbofan <span class=\"highlight\">engine<\/span> acoustic liner design and analysis. The first is a statistical approach for broadband liner design and assessment. The second is graphical software to design and analyze resonant channels in acoustic liners.",
            "LAR-TOPS-185",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-185\/Front.jpg",
            "",
            15.23386
        ],
        [
            "59fa071c9600022c4d6667dc",
            "LAR-TOPS-179",
            "Aircraft Active Pylon Noise Control System",
            "This technology is a new type of aircraft pylon design for noise control. A pylon connects the <span class=\"highlight\">engine<\/span> to the airframe of an aircraft. This design uses air passing through the pylon to actively disrupt the jet <span class=\"highlight\">engine<\/span> exhaust stream after it exits the <span class=\"highlight\">engine<\/span>, disrupting and redistributing the axial and azimuthal distributed sources of jet noise from the aircraft.",
            "LAR-TOPS-179",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-179\/TOP 179 front.jpg",
            "",
            13.853815
        ],
        [
            "5a8bfb4f960002d3369c2161",
            "LEW-TOPS-56",
            "Conditionally Active Min-Max Limit Regulators",
            "The control system in modern commercial aircraft engines is designed to operate the <span class=\"highlight\">engine<\/span> in a safe manner throughout its operating envelope. In order to utilize the existing safety margins more effectively, Innovators at NASA's Glenn Research Center have developed a modification to current min-max <span class=\"highlight\">engine<\/span> control logic.  This architecture is referred to as a conditionally active (CA) limit regulator. This concept uses the existing min-max architecture with the modification that limit regulators are active only when the operating point is close to a particular limit, improving <span class=\"highlight\">engine<\/span> response while preserving all necessary safety limits.  An improvement in thrust response while maintaining all necessary safety limits was also demonstrated.",
            "LEW-TOPS-56",
            "aeronautics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-56\/iStock_000056646008_LEW-18934-1_instrument-panel_1388x1050-300DPI.jpg",
            "",
            13.111918
        ],
        [
            "5a8bf8d4960002d1365f1a00",
            "LEW-TOPS-61",
            "Compact, Lightweight, CMC-Based Acoustic Liner",
            "In the wake of recent developments that have reduced fan and jet noise contributions to overall jet-<span class=\"highlight\">engine<\/span> noise, aircraft designers are turning their attention toward reducing <span class=\"highlight\">engine<\/span> core noise. Innovators at NASA's Glenn and Langley Research Centers are teaming to develop a compact, lightweight acoustic liner based on oxide\/oxide ceramic matrix composite (CMC) materials. The CMC acoustic liner has variable-depth channels tuned to reduce broad-spectrum noise in subsonic jet engines. The design of those channels has also been focused on structures that minimize the overall liner thickness. Because the technology uses CMCs, rather than heavy metallic materials, it has the potential to reduce overall <span class=\"highlight\">engine<\/span> weight. The oxide\/oxide CMC materials are able to withstand extremely high temperatures as well. These CMC acoustic liners can be used in many subsonic jet engines - particularly for next-generation aircraft - to reduce <span class=\"highlight\">engine<\/span> core noise. Also, because they can withstand high temperatures, core liners constructed with CMC materials can also provide a thermal barrier.",
            "LEW-TOPS-61",
            "aeronautics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-61\/LEW-18769-1_airplane-noise_1388X1050-300DPI.jpg",
            "",
            13.105287
        ],
        [
            "59fa040a9600022c4d820e70",
            "LAR-TOPS-70",
            "Advanced Over-the-Wing Nacelle Transport Configuration",
            "NASA's Langley Research Center has developed a new\naircraft design with the <span class=\"highlight\">engine<\/span> nacelle over the wing, improving\n<span class=\"highlight\">engine<\/span> ground clearance and freeing landing gear design. While\nprevious over-the-wing designs have produced unacceptably\nhigh drag conditions, the new NASA design reduces drag\non the wing. By optimizing the nacelle design and the wing\nleading edge location, NASA's design confines the shock to\nthe leading edge of the wing. Also, placing the exhaust nozzle\nover the wing reduces noise to the communities below.",
            "LAR-TOPS-70",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-70\/TOP83_front.jpg",
            "",
            12.522535
        ],
        [
            "5bd459524725197cf92af64e",
            "LAR-TOPS-288",
            "Spanwise Traveling Electro Pneumatic Actuator for Flow Control Applications",
            "Active Flow Control (AFC) systems have the potential to dramatically improve the performance (reduce fuel burn, reduce noise, runway path, etc.) of aircraft. AFC methods are usually designed to add energy into the free air stream flowing over the wing and flaps.  An effective control strategy implies minimal energy expenditure to achieve desired flow control authority.  The energy required is siphoned from the aircraft engines and is thus limited for this use. Currently, the Achilles heel of AFC systems is that the <span class=\"highlight\">engine<\/span> power drain required to activate the all flow nozzles at once exceeds the excess <span class=\"highlight\">engine<\/span> power available for this function.\nThe approach described here achieves a dramatic reduction in power\/mass flow demand on the aircrafts engines during a landing approach, making AFC feasible for aircraft by re-imagining conventional approaches.  (<span class=\"highlight\">Engine<\/span> power is necessarily limited during a landing approach, leaving very little bleed air available for powering AFC systems.)",
            "LAR-TOPS-288",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-288\/1.1.jpg",
            "",
            12.432501
        ],
        [
            "5b126a40960002b10a9f2bb3",
            "LEW-TOPS-119",
            "Capacitive Pressure Sensor System and Packaging",
            "Innovators at NASA's Glenn Research Center have developed a state-of-the-art packaged capacitive pressure sensor system that provides in-situ dynamic data acquisition in harsh operating environments. Designed to monitor jet turbofan <span class=\"highlight\">engine<\/span> health, this pressure sensor can be placed directly on the <span class=\"highlight\">engine<\/span> for highly accurate, real-time data analysis. Another unique feature of this simply designed system is that it can be fitted with an antenna to transmit data wirelessly. This smart sensing technology has undergone extensive testing in extreme environments and is expected to play a key role in the development of a suite of next-generation maintenance and monitoring systems. This important sensor system and packaging can provide more accurate data, improve performance, and extend the service lifetime of commercial and military aircraft, automotive engines, power plants, and more.",
            "LEW-TOPS-119",
            "sensors",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-119\/iStock-118958406_1_LEW-19424_navy-figher-plane_1388x1050-300dpi.jpg",
            "",
            11.737249
        ],
        [
            "59fa08849600022a4d89ccfb",
            "LAR-TOPS-208",
            "Self-Latching Piezocomposite Actuator",
            "NASA Langley Research Center has developed a self-latching piezocomposite actuator. The self-latching nature of this invention allows for piezo actuators that do not require constant power draw. Among other applications, the invention is well suited for use in aerodynamic control surfaces and <span class=\"highlight\">engine<\/span> inlets.",
            "LAR-TOPS-208",
            "mechanical and fluid systems",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-208\/Airplane.jpg",
            "",
            11.700977
        ],
        [
            "5acf46c9960002b85d4870b5",
            "MFS-TOPS-88",
            "Rocket Nozzle Side-Load Analysis Software",
            "NASA&#39s Marshall Space Flight Center has developed rocket nozzle load analysis software.Lateral nozzle forces are known to cause severe structural damage during testing of any new rocket <span class=\"highlight\">engine<\/span> configuration under development. While three-dimensional computational fluid dynamics methodology has been previously demonstrated to describe major side-load physics on rigid nozzles, actual hot-fire tests often show nozzle structure non-rigid flexing behavior during major side-load events. This can lead to structural damage. The innovators at NASA&#39s Marshall Space Flight Center have expanded and improved upon their rigid-wall analysis model and have created new analysis software to provide an expanded modeling picture that accounts for the two-way responses between the rigid or flexible structure and fluid. This analysis capability now offers a more complete and realistic analysis of rocket-nozzle side-wall loading during the transient start-up phase of hot-fire rocket <span class=\"highlight\">engine<\/span> testing.",
            "MFS-TOPS-88",
            "information technology and software",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-88\/Front_MFS-33161_RocketNoz_1388x1050.jpg",
            "",
            11.693991
        ],
        [
            "5a8bf832960002171d4326a7",
            "TOP2-271",
            "Airborne Background Oriented Schlieren Technique",
            "NASA has developed a novel method to render visible the density changes in air that cause a refractive index change by an airborne vehicle. These density changes include shock waves, vortices, <span class=\"highlight\">engine<\/span> exhaust, and wakes. The determination of location and strength of shockwaves and vortices is fundamental to understanding the flow around an aircraft. These features are strong enough to affect the environment that the vehicle inhabits: for example, they can cause drag and\/or produce undesirable noise. The researcher must be able to predict and mitigate the effects of these flow features.  This invention is a robust visualization technique that will permit the measurement of the strengths and positions of shock waves caused by supersonic vehicles. The technique is applicable to all flight regimes, however, and can be used for visualizing tip vortices, <span class=\"highlight\">engine<\/span> exhaust plumes.",
            "TOP2-271",
            "aeronautics",
            "",
            "",
            "",
            "ARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/TOP2-271\/ARC-17673-1 F7P5_LK_Dy_plane_for TechFlyer (002).jpg",
            "",
            11.611757
        ],
        [
            "59fa120e9600022c4d6b76d2",
            "LAR-TOPS-181",
            "Noise Reducing Trailing Edge Device",
            "This technology is a new type of design for the wing flap, aileron, or flaperon located directly behind the <span class=\"highlight\">engine<\/span> nozzle on jet aircraft. Using a concave-down curved shape for the trailing edge instead of a conventional right angle, the cross section of the flap, aileron, or flaperon directly in the jet exhaust stream is reduced, thus reducing noise.",
            "LAR-TOPS-181",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-181\/nasa-shuttle-carrier-aircraft.jpg",
            "",
            11.285665
        ],
        [
            "5a8bf22f9600025c1d3a0a98",
            "TOP2-128",
            "ShuttleSCAN 3-D",
            "NASA Ames Research Center offers for license its patented ShuttleSCAN 3-D surface scanning and profiling technology. Originally developed for critical, real-time inspection of damage to the thermal protection tiles of the Space Shuttle, this advanced system can be used for a wide range of commercial applications from product quality control to autonomous navigation. Powered by the onboard Surface Profiling and Characterization <span class=\"highlight\">Engine<\/span> (SPACE) processor, ShuttleSCAN provides real-time analysis of surfaces ranging from the small (such as circuit boards) to the large (such as panels or roads).",
            "TOP2-128",
            "instrumentation",
            "",
            "",
            "",
            "ARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/TOP2-128\/ARC-14652 3D Laser Scanner 1388x1050.jpg",
            "",
            10.592447
        ],
        [
            "59086aaf960002957b98706f",
            "MFS-TOPS-5",
            "Variable-Power Handheld Laser Torch",
            "NASA's Marshall Space Flight Center developed the handheld laser torch, designed for welding and brazing metals, to repair hard-to-reach Space Shuttle <span class=\"highlight\">engine<\/span> nozzles. It incorporates various manual controls and changing lenses to allow the operator to adjust the lasers power output in real time. The controls and lenses are designed to increase precision, portability, and maneuverability as compared to existing automated lasers and traditional welding techniques such as tungsten inert gas (TIG), metal inert gas (MIG). or gas-tungsten arc welding (GTAW) systems. Proximity sensors with automated shut-off switches also ensure a high level of safety for the user.",
            "MFS-TOPS-5",
            "manufacturing",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-5\/Front_NP-2014-08-1161-HQ.jpg",
            "",
            10.421612
        ],
        [
            "59fa11309600022a4d1c775e",
            "LAR-TOPS-152",
            "External Aircraft Noise Reduction Liners",
            "NASA Langley Research Center, in collaboration with Boeing and Lockheed Martin, has developed a new external acoustic liner for aircraft noise reduction. While the acoustic liner can be placed on any external aircraft surface, one attractive application is for open rotor noise reduction. Airframe manufacturers are considering open rotor engines for future aircraft designs as they provide significant fuel savings. However, open rotor engines have no nacelle and, thus, do not allow the use of conventional nacelle liners for noise abatement. This technology strategically places acoustic liners on the external surface of the aircraft to reduce such <span class=\"highlight\">engine<\/span> noise.",
            "LAR-TOPS-152",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-152\/Open Rotor.jpg",
            "",
            10.421612
        ],
        [
            "5cc026014fa2152178011172",
            "LAR-TOPS-311",
            "Supersonic Laminar Flow Control",
            "NASA's Langley Research Center has developed a technology that is projected to extend the laminar flow area over supersonic flight configurations by delaying the transition of boundary layer flow from laminar to turbulent state. This controls laminar flow over airframe components including wings, empennage, <span class=\"highlight\">engine<\/span> nacelles, and the nose region of an aircraft fuselage. It can be used in combination with many of the existing techniques for passive and active laminar flow control, but is particularly well-suited for a supersonic natural laminar flow design by virtue of avoiding the space, weight, system complexity, and maintenance penalties associated with suction based laminar flow control.",
            "LAR-TOPS-311",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-311\/311.1.2.jpg",
            "",
            10.260903
        ],
        [
            "5daad0d440205c76226ab3a2",
            "LAR-TOPS-314",
            "Low, Drag, Variable-Depth Acoustic Liner",
            "A low-drag, variable-depth acoustic liner has been designed for aircraft noise reduction. The technology can be used as a conventional <span class=\"highlight\">engine<\/span> nacelle liner, or on the external surfaces of an aircraft to reduce acoustic scattering. As compared with conventional liners, the technology provides increased broadband acoustic performance with less drag. Conventional liners use a perforated facesheet as the outermost portion of the liner exposed to flow. The perforated facesheet has a higher drag than a smooth surface, but is necessary to reduce noise. The proposed innovation reduces the open area of the facesheet, and therefore reducing the drag of the liner, without compromising acoustic performance.",
            "LAR-TOPS-314",
            "mechanical and fluid systems",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-314\/314-f2.jpg",
            "",
            10.260903
        ],
        [
            "5a8bfd95960002d136be8a1b",
            "LEW-TOPS-110",
            "Thermal Management for Aircraft Propulsion Systems",
            "Innovators at NASA's Glenn Research Center have developed a lightweight, reliable thermal management system, for both ambient and cryogenic propulsion systems, that increases overall fuel efficiency from 40 to 60 percent. Conventional aircraft propulsion systems struggle to keep high-powered electric motors and electronics cool without resorting to extra mass and complexity that negate the benefits of electric propulsion in aircraft. Glenn's thermal management system uses the normally wasted energy from turbofan propulsion to cool electronics and power equipment. The waste heat produces a high-intensity acoustic wave, created from the temperature gradient between the hot and cold heat exchangers. This acoustic wave energy propagates through thermoacoustic power tubes, where it can be used for component cooling or converted to electric power via a linear alternator. Glenn's system can provide highly efficient electric power to aircraft components while cooling the aircraft's propulsion system without added mass and complexity.",
            "LEW-TOPS-110",
            "power generation and storage",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-110\/NASAimage_Helios_in_flight_1388x1050-300dpi.jpg",
            "",
            10.065752
        ],
        [
            "5eeb2d1f40205c09350ad982",
            "DRC-TOPS-28",
            "AirBOS-SR: Visualizing Supersonic Shock Waves with Advanced Imaging Techniques",
            "Researchers at NASA's Armstrong Flight Research Center and Ames Research Center have developed an innovative approach for capturing images of shock waves emanating from aircraft in supersonic flight. The Air-to-Air Background Oriented Schlieren with Simultaneous Referencing (AirBOS-SR) approach offers a significant upgrade over previous schlieren techniques because it enables multiple frames of close-up images from various angles, including a side-view perspective. NASA will use this schlieren technology to confirm the design of the agency's X-59 Quiet Supersonic Technology (X-59 QueSST) aircraft, anticipated to produce a soft thump in place of a disruptive sonic boom.  In addition to many supersonic uses, the new technique also has potential uses for visualizing air density gradients of wing tip vortices, <span class=\"highlight\">engine<\/span> plumes, and rotorcraft.",
            "DRC-TOPS-28",
            "aeronautics",
            "",
            "",
            "",
            "DFRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/DRC-TOPS-28\/Schlieren_SideView_1388x1050.jpg",
            "",
            9.966471
        ],
        [
            "5beea98947251963265031e5",
            "LEW-TOPS-127",
            "Packaging for SiC Sensors and Electronics",
            "Innovators at NASA's Glenn Research Center have developed a planar, modular package that protects electronics and sensors more effectively in high-temperature conditions than previously available methods. Lack of reliability at high temperatures, due to poor packaging, have discouraged the global application and large-scale commercialization of high-temperature electronics and sensors. Capable of preserving operations even in a 600&deg;C environment, this innovation offers hermetic protection for silicon carbide (SiC)-based devices, such as dynamic pressure sensors, static pressure sensors, temperature sensors, acoustic impedance channels, and buried connecting wires. This patented technology is a game-changer for industries that need semiconductor-based sensors and electronics to function optimally in high-temperature, extreme-vibration, and corrosive environments - from jet <span class=\"highlight\">engine<\/span> combustion chambers to nuclear power plants, and from deep-well drilling to Venus missions.",
            "LEW-TOPS-127",
            "electrical and electronics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-127\/iStock-511852120_LEW-17256_jet-turbine-profile_1388x1050-300dpi.jpg",
            "",
            9.831276
        ],
        [
            "5a8bfa00960002171d2835fa",
            "LEW-TOPS-80",
            "Stirling Thermoacoustic Power Converter and Magnetostrictive Alternator",
            "Innovators at NASA's Glenn Research Center have developed two novel technologies that make Stirling engines more efficient and less costly. First, Glenn's thermoacoustic power converter uses sound to turn heat into electric power. Utilizing heat-driven pressures and volume oscillations from thermoacoustic sources to power piezoelectric alternators or other power-converter technologies, this device can generate electricity with unprecedented efficiencies. Unlike conventional Stirling-based devices, this thermoacoustic  <span class=\"highlight\">engine<\/span> achieves high thermal-to-electrical efficiencies with no moving parts. Glenn's second advancement for Stirling engines replaces the conventional linear alternator with a magnetostrictive alternator that converts the oscillating pressure wave into electric power (see cut-away diagram above). These innovations offer a reliable and efficient way to generate power from any heat source, benefiting applications such as combined heat and power (CHP) systems, distributed generation, solar power generation, and heating and cooling systems.",
            "LEW-TOPS-80",
            "power generation and storage",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-80\/iStock_000014775032-153709217_LEW-18802_solar-panels_1388x1050-300dpi.jpg",
            "",
            9.703248
        ],
        [
            "5a8bfba1960002d3369c2167",
            "LEW-TOPS-51",
            "Advanced Protective Coatings for Graphite-Based Nuclear Propulsion Fuel Elements",
            "Scientists at NASA's Glenn Research Center have developed novel ways to protect fuel elements used in hot hydrogen gas-propelled nuclear thermal propulsion (NTP) engines. These fuel elements often feature a graphite (Gr)-based substrate, which can react with the hydrogen to form methane and other hydrocarbons, leading to a hot hydrogen corrosive attack. As a result, the Gr-based substrate erodes with time, thus affecting reactor neutronics and performance and leading to a premature shut-down of the NTP <span class=\"highlight\">engine<\/span>. Glenn's researchers have conceptualized a technique to create and layer protective coatings that act as a diffusion barrier between the hydrogen and the substrate. These innovations will potentially have a  broad impact, as fuel elements for nuclear reactors increasingly have applications in the commercial nuclear power industry, nuclear powered submarines and ships, and outer space systems.",
            "LEW-TOPS-51",
            "materials and coatings",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-51\/LEW-19240_orion_1388x1050-300DPI.jpg",
            "high temperature materials",
            9.703248
        ],
        [
            "5d36ccf83ace9411ca0d9dc1",
            "MFS-TOPS-96",
            "Reverse Vortex Ring (RVR)",
            "Innovators at the Marshall Space Flight Center (MSFC) have developed a mechanism for improving rotordynamic stability and response in turbomachinery. The Reverse Vortex Ring (RVR) invention was created specifically to solve instability problems with turbopumps on the Space Shuttle main <span class=\"highlight\">engine<\/span>, which has been a persistent problem for NASA engineers since the 1970s.\n\nWith the advent of rotating machinery, high-speed rotors have been of interest to engineers. Rotating machinery has been employed in a wide range of applications in the past century, ranging from steam turbines for electric power generation to the turbo pumps used in the Space Shuttle Main Engines. As these machines have become more commonplace, there has been an increased demand for lightweight, compact designs. The required power output of these units has also increased leading to ever high power to weight ratios. These leaner designs are the hallmark of the aerospace industry.",
            "MFS-TOPS-96",
            "mechanical and fluid systems",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-96\/MFS_33288_1_TOPS_Front_Graphic_alex.jpg",
            "",
            9.581829
        ],
        [
            "5a8bfd5f960002171d969897",
            "LEW-TOPS-106",
            "Double-Acting Extremely Light Thermo-Acoustic (DELTA) Convertor",
            "NASA's Glenn Research Center has developed a novel Double-acting Extremely Light Thermo-Acoustic (DELTA) convertor that operates at high frequencies (>400Hz) with greatly increased specific power and no moving parts. Conventional <span class=\"highlight\">engine<\/span> power systems grow substantially in size and weight as their power level increases, as they manage their required reactive force, produced centrifugal force, or achievable current flow. In contrast, the DELTA convertor enables an order of magnitude improvement in specific power compared to conventional engines. The DELTA convertor harnesses the power of thermoacoustics by relying on the relationship between the temperature and pressure oscillations present in sound waves. By using thermoacoustics to drive a double-action piston, this revolutionary DELTA convertor enables a lightweight, maintenance-free, high specific power system ideal for unmanned aircraft vehicles, next-generation aircraft, mobility on demand, and any power system in which efficiency, size, and weight are critical.",
            "LEW-TOPS-106",
            "power generation and storage",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-106\/iStock_500146389_LEW-19387-1_spy-fixed-wing-drone_1388x1050-300dpi.jpg",
            "",
            9.581829
        ],
        [
            "5b90f96996000294644e0a0a",
            "LEW-TOPS-124",
            "Spanwise Adaptive Wing",
            "NASA's Glenn Research Center is providing the opportunity to license a novel means of articulating the outboard portion of an aircraft wing to create the optimal geometry for given flight conditions. The Spanwise Adaptive Wing (SAW) concept employs a high-force, solid-state Shape Memory Alloy (SMA)-based actuator to develop a structurally efficient and reliable method of deflecting a portion of the wing in-flight. This ability enables significant increases in lateral-directional stability and control augmentation, thereby enhancing aircraft efficiency by reducing the rudder motion to control yaw. Particularly in supersonic flight, the SAW's benefits include increased compression lift and reduced wave drag. Compared to prior hydraulic-based actuators, the SMA-based actuator features significantly reduced size and weight, high specific work output, solid-state actuation, low maintenance, and high reliability. The SAW is a breakthrough technology for boosting <span class=\"highlight\">engine<\/span> performance and reducing energy consumption.",
            "LEW-TOPS-124",
            "aeronautics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-124\/NASAimage_LEW-19481_EC93_1388x1040-300dpi.jpg",
            "",
            9.581829
        ],
        [
            "595b66d9960002cd0700c9a5",
            "GSC-TOPS-71",
            "Automata Learning in Generation of Scenario-Based Requirements in System Development",
            "NASA sensor networks can be highly distributed autonomous systems of systems that must operate with a high degree of reliability. The solar system and planetary exploration networks necessarily experience long communications delays with Earth. The exploration networks are partly and occasionally out of touch with the Earth and mission control for long periods of time, and must operate under extremes of dynamic environmental conditions. Due to the complexity of these systems as well as the distributed and parallel nature of the exploration networks, the exploration networks have an extremely large state space and are impossible to test completely using traditional testing techniques. The more code or instructions that can be generated automatically from a verifiably correct model, the less likely that human developers will introduce errors.",
            "GSC-TOPS-71",
            "information technology and software",
            "",
            "",
            "",
            "GSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/GSC-TOPS-71\/automata-learn-front.jpg",
            "",
            9.50886
        ],
        [
            "5a8bfc4b960002171d624a4a",
            "LEW-TOPS-35",
            "High-Speed Smart Camera Detects Supersonic Inlet Shocks",
            "A new smart camera developed at NASA's Glenn Research Center has the ability to process and transmit valuable edge location data for the images that it captures - at a rate of over 900 frames per second. The camera was designed to operate as a component in an inlet shock detection system for supersonic jets. A supersonic jet cannot function properly unless the airflow entering the machine is compressed and slowed to subsonic speed in the inlet before it reaches the <span class=\"highlight\">engine<\/span>. When supersonic air is compressed, it forms shock waves that can destroy the turbofan and surrounding components unless they are pinpointed and adjusted. This smart camera uses an edge detection signal processing circuit to determine the exact location of shock waves, and sends the location information via an onboard microcontroller or external digital interface. This highly customizable camera's ability to quickly identify precise location data makes it ideal for a variety of other applications where high-speed edge detection is needed.",
            "LEW-TOPS-35",
            "manufacturing",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-35\/iStock_000053061424_LEW-18816-1_fast-car_1388x1050-300DPI.jpg",
            "",
            9.466522
        ],
        [
            "5a992d4f960002a73ca011f0",
            "LEW-TOPS-114",
            "Double-Fed Induction Linear Alternator",
            "Innovators at NASA's Glenn Research Center have developed a lightweight, double-fed induction linear alternator capable of highly efficient extreme-environment performance. While traditional linear alternators cannot withstand temperatures of 250&deg;C, this innovation has the ability to operate at 950&deg;C with increased performance and efficiency. The innovation replaces the traditional permanent magnet with a copper electromagnetic Halbach circular array (essentially a 3D printed copper coil). Its simple design also eliminates iron, slip rings, and - because it is fabricated as a single piece - adhesives. As a result, it is easy to maintain, does not require iron flux containment and experiences minimal electromagnetic interference. When used with the double action extremely light thermo-acoustic (DELTA) converter, the <span class=\"highlight\">engine<\/span>\/alternator system is one-tenth the weight of a traditional system. This economical alternator enables unprecedented performance for high-temperature environments such as aircraft power systems, micro combined heat and power (CHP), and downhole drilling.",
            "LEW-TOPS-114",
            "power generation and storage",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-114\/LEW-19354-1 Front.jpg",
            "",
            9.466522
        ],
        [
            "5a8bfb93960002d3369c2166",
            "LEW-TOPS-69",
            "Analog Signal Correlating",
            "This innovation from NASA's Glenn Research Center is capable of correlating two analog signals by using an analog-based signal conditioning front end to hard-limit the analog signals through adaptive thresholding into a binary bit stream.  The correlation is then performed using a Hamming similarity calculator function embedded in a one-bit digital correlator (OBDC). By converting the analog signal into a bit stream, the calculation of the correlation function is simplified, and fewer hardware resources are needed. This binary representation allows the hardware to move from a digital signal processor, where instructions are performed serially, into digital logic where calculations can be performed in parallel, greatly speeding up calculations.",
            "LEW-TOPS-69",
            "electrical and electronics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-69\/iStock_000009319235_LEW-18902-1_MQ-1-predator_1388x1050-300DPI.jpg",
            "",
            9.362531
        ],
        [
            "5a8bf942960002d336cb706b",
            "LEW-TOPS-42",
            "Graphene-Based Reversible Nano-Switch\/Sensor Schottky Diode Device",
            "NASA's Glenn Research Center has developed a groundbreaking new microsensor that detects toxic gases and explosives in a variety of environments. Most devices can perform only a unidirectional sensing task, lacking a switching feature that would allow the device to return to baseline operation after the volatile species is removed or has dissipated. Glenn's nano-Switch Sensor Schottky Diode (nanoSSSD) device consists of a thin film of graphene deposited on a specially prepared silicon wafer. Graphene's two-dimensional properties make this technology both extremely sensitive to different gases and highly reliable in harsh, enclosed, or embedded conditions. The nanoSSSD can be connected to a visual and\/or sound alarm that is autonomously triggered as the sensor detects a selected gas and then returned to its passive mode when the gas is no longer present. The innovation has applications in biomedical devices, combustion engines, and detection\/switching devices used in mass transit systems.",
            "LEW-TOPS-42",
            "electrical and electronics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-42\/iStock_000036296624-479924165_LEW-18477-1_underground-mine_1388x1050-300dpi.jpg",
            "",
            9.261802
        ],
        [
            "5b51b27a960002af43fc5a30",
            "LEW-TOPS-121",
            "Oil-Free Lubricants",
            "NASA's Glenn Research Center has developed high-temperature solid lubricant materials to reduce friction and wear in mechanical components, especially in extreme temperatures. The lubricant performs in temperatures from cryogenic levels to greater than 900&deg;C. It has been formulated to provide higher density, smoother surface finish, and better dimensional stability than prior solid lubricant coatings. It can be applied either through plasma spraying as a coating, known as PS400, or as a solid composite material via powder metallurgy, known as PM400. Because of its ability to maintain thermal and chemical stability in higher temperatures, PS\/PM400 enables efficiency increases of up to 40% in rotating machinery applications. Furthermore, PS\/PM400 has proven durable in over 20,000 hours of turbine <span class=\"highlight\">engine<\/span> operation.  PS\/PM400 offers a substantial upgrade in wear resistance and efficiency for a vast range of aerospace and aeronautics applications. Its unique combination of good mechanical properties, long-term environmental durability, exceptional friction and wear-reducing characteristics, higher density, smoother finish, and better dimension stability establishes it in a class by itself among solid self-lubricating materials.",
            "LEW-TOPS-121",
            "materials and coatings",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-121\/GRCimage_LEW-18561_superelastic_bearings_1388x1050-300dpi.jpg",
            "tribological materials",
            9.252483
        ],
        [
            "5a8bfd45960002171d969895",
            "LEW-TOPS-104",
            "High-Voltage Power System for Hybrid Electric Aircraft Propulsion",
            "Innovators at NASA's Glenn Research Center have developed a variable-frequency, alternating current (AC) power system to enable turbo-electric and hybrid electric propulsion. Glenn's technology uses double-fed electric machines and a high-voltage, variable-frequency power system to significantly decrease (by 85%) the weight of an aircraft's power electronics for turbo-electric propulsion, while still providing high specific power and variable thrust. To provide a safe system, the lightweight electric machines operate at high frequency, allowing fast detection and clearance of faults without requiring switchgear that interrupts the current. This design also reduces the protection system's weight, while improving reliability by minimizing fault energy and collateral damage potential. In addition, the system permits either sub-synchronous or super-synchronous operation relative to throttle position, without having to adjust turbine settings. Glenn's innovative system raises the ceiling for hybrid electric aircraft.",
            "LEW-TOPS-104",
            "propulsion",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-104\/GRC_LEW-19294-1_nasa-hwb-full_1388x1050-300dpi.jpg",
            "",
            9.077951
        ],
        [
            "5a8bfb36960002d3369c215f",
            "LEW-TOPS-54",
            "Fuzzy Neuron: Method and Hardware Realization",
            "Researchers at NASA's Glenn Research Center have developed simple and effective learning functions and adaptive elements that can be placed into small hardware systems including instruments for space, implantable medical devices, and stochastic observers.  Small instruments for spaceflight and other applications have been confined to simple systems utilizing microcontrollers and a microcontroller core. Since most learning algorithms typically reside in larger computational frames and are rather complex (neural nets, for example), a simpler solution to self-learning, auto-adaptive systems is attractive for smaller embodiments. Fuzzy logic systems lend themselves well to microcontrollers, but adaptive fuzzy systems also require a good deal of computational power. Thus, Glenn innovators selected the simpler components of both fuzzy systems (input membership functions) and the back error propagation neural net (the linear combiner) to fuse into a simple two-layer system that can be easily embedded into common microcontrollers.",
            "LEW-TOPS-54",
            "electrical and electronics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-54\/iStock_000009260680_LEW-18887-1_car-cross-section_1388x1050-300DPI.jpg",
            "",
            9.073684
        ],
        [
            "5a8bf5c4960002171ded384a",
            "TOP2-251",
            "Aeroelastic Wing Shaping",
            "NASA has developed a new method of wing shaping using distributed propulsion that can revolutionize the design of aircraft. Distributed propulsion aeroelastic wing shaping is a new aircraft concept. Most commercial aircraft are still utilizing one gas-turbine <span class=\"highlight\">engine<\/span> per wing. By contrast, distributed propulsion envisions the use of multiple small electrically powered propulsion units distributed along the wings. By taking advantage of increased wing flexibility afforded by the use of light-weight materials such as composites, the aeroelastic deflection of a wing can be actively shaped in-flight for optimal aerodynamic efficiency by varying the amount of thrust generated by the propulsion units. By using distributed propulsion, the optimal wing shape can be used for other phases such as takeoff, landing, and in-flight maneuvers. In addition, distributed propulsion can be leveraged for yaw and roll controls, thus reducing the need for a full vertical tail size for weight savings. Thus, an entire aircraft design can be developed more creatively using distributed propulsion concepts for reduced fuel burn. Initial performance analysis indicates that this concept could achieve about 4% increase in lift-to-drag ratio.",
            "TOP2-251",
            "aeronautics",
            "",
            "",
            "",
            "ARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/TOP2-251\/ARC-17372-1_1388x1050.jpg",
            "",
            9.058022
        ],
        [
            "5a8d6651960002826545538f",
            "LAR-TOPS-256",
            "Variable-Depth, Multi-Layer Liner for Aircraft Noise Reduction",
            "NASA Langley Research Center has developed a new approach for designing aircraft liner cores for noise reduction. These liner cores are comprised of multiple honeycomb-shaped chambers, each of which may contain one or more embedded porous septa. By varying the resistance and insertion depth of the septa between adjacent honeycomb core chambers, the number of tuning frequencies is increased for the full liner. High resistance septa can also be used to change the effective chamber depth. Together, these design features cause the acoustic liner to absorb sound over a broad frequency range.",
            "LAR-TOPS-256",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-256\/LAR18319_front.jpg",
            "",
            8.985718
        ],
        [
            "5ddcf7e740205c094735ed32",
            "LAR-TOPS-22",
            "Quick Change Ceramic Flame Holder",
            "NASA's Langley Research Center is seeking to improve upon stock stainless steel flame holders. Researchers at NASA's Langley Research Center have developed a new ceramic design with a service temperature of 4,000F. The combination of high strength and high temperature capability and a twist lock mounting method to the steel burner sets this flame holder apart from existing technology.",
            "LAR-TOPS-22",
            "propulsion",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-22\/CeramicFlame.jpg",
            "",
            8.985718
        ],
        [
            "564834f495dd5e660772eb3c",
            "MFS-TOPS-39",
            "Cryogenic & Non-Cryogenic Liquid Level Instrument",
            "NASA's Marshall Space Flight Center has developed a unique prototype for measuring the liquid level in a tank, employing a novel process. The technology can operate in a wide range of environments, including high and low temperatures and pressures, and is simpler and less expensive than other optical sensing techniques. The instrument also provides far greater accuracy and faster results in cryogenic conditions than typical cryogenic liquid metering methods. It is ideal for cryogenic and non-cryogenic ground tank metering applications, and zero-gravity systems that include stratification or settling techniques.",
            "MFS-TOPS-39",
            "sensors",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-39\/Front_NP-2014-08-1159-HQ.jpg",
            "",
            8.972288
        ],
        [
            "5a8bfa999600025c1d0ef7c6",
            "LEW-TOPS-28",
            "Temperature-Sensitive Coating Enables Easy Measurement up to 600&deg;C",
            "Innovators at NASA's Glenn Research Center have developed a temperature-sensitive coating based on hematite (iron III oxide). Painted onto a surface, the coating gradually changes color from a reddish-brown at room temperature to black-gray at 600&deg;C. The color change is reversible and repeatable, as temperature cycles from low to high and back again. The technology greatly improves on conventional photoluminescence techniques, which work only with high-intensity short wavelength light. Because Glenn's innovation works in white light, which is easily produced, color changes can be detected and recorded using low-cost sensors instead of single-point or global-imaging-based detectors. The coating is inexpensive and easy to apply, and it contours to complex shape surfaces. Developed for use in NASA's high-speed aircraft test facilities, the coating also offers exciting new industrial and automotive potential.",
            "LEW-TOPS-28",
            "materials and coatings",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-28\/iStock_000012112139_LEW-18761-1_industrial-furnace_1388x1050-300DPI.jpg",
            "smart materials",
            8.769481
        ],
        [
            "5af431b29600027006a0e0b2",
            "MFS-TOPS-81",
            "Cladding and Freeform Deposition for Coolant Channel Closeout",
            "Low-cost, large-scale liquid rocket engines with regeneratively cooled nozzles will enable reliable and reduced-cost access to space. Coolant, contained under high pressure, circulates through a bank of channels within the nozzle to properly cool the nozzle walls to withstand high temperatures and prevent failure. It has been a challenge to affordably manufacture and close out  the intricate nozzle channels. As such, NASA developed a robust and simplified additive manufacturing technology to build the nozzle liner outer jacket to close out the channels within and contain the high-pressure coolant. The new Laser Wire Direct Closeout (LWDC) capability reduces the time to fabricate the nozzle and allows for real-time inspection during the build. One variation enables a bimetallic part (copper\/super-alloy, e.g.) to help optimize material where it is needed. The manufacturing process has been demonstrated on a series of different alloys. Hot-fire testing is complete&#8212the parts were exposed to extreme combustion chamber temperatures and pressure conditions for 1,000+ seconds. Micro-graph examination of the hot-fired test article has verified that the coolant channel closeout bonds are reliable and that there is very little deformation to the coolant channels. The picture above was taken during the hot-fire testing of a nozzle.",
            "MFS-TOPS-81",
            "manufacturing",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-81\/Front_116201707cp1_009_1388x1050.jpg",
            "",
            8.743227
        ],
        [
            "5ca7194c47251963aa227913",
            "LEW-TOPS-132",
            "Conductive High-Toughness Oxides",
            "Innovators at NASA's Glenn Research Center have developed a novel method for making oxide coatings that have excellent mechanical strength and electronic conductivity at room temperature. Using the Plasma Spray-Physical Vapor Deposition (PS-PVD) processing methodology, Glenn researchers have been able to produce a coating containing a metastable phase that no other method can achieve. Upon exposing the material to moderate temperatures (greater than 300&deg;C) in the presence of oxygen, the metastable phase is further oxidized, and the material becomes insulating while retaining its high toughness and microstructure. With this innovation, a coating can be created from any metal oxide, including rare earth oxides, zirconium oxide, hafnium oxide, titanium oxide, or any combination of two or more oxides. Glenn's innovation has great potential for industries that require increasingly tough ceramic coatings, such as electronics, chemical and petroleum refineries, the aerospace industry, and automotive and aeronautics manufacturing.",
            "LEW-TOPS-132",
            "materials and coatings",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-132\/NASAimage_LEW-19385_Conductive-Oxides_1388x1050-300dpi.jpg",
            "",
            8.70939
        ],
        [
            "5b28d3099600027c2cbc31cd",
            "LEW-TOPS-109",
            "A Method for Reducing Broadband Noise",
            "Researchers at NASA's Glenn and Langley Research Centers have developed a groundbreaking bio-mimicking acoustic liner for quieting noisy environments. Conventional approaches have not been able to absorb sound effectively in the 400-3000 Hz range, thereby subjecting humans to excessive noise pollution at the low end of the auditory range. The NASA innovation relies on parallel-stacked tube filters, which improve noise reduction in this range by as much as 25% over conventional melamine or honeycomb solutions. Inspired by the structure of natural reeds, these porous tubes are arranged to maximize acoustic absorption while also realizing significant benefits in weight, size, and extreme-temperature functionality. Since broadband noise represents one of the most significant potential environmental constraints to increasing capacity, efficiency, and flexibility in a host of different arenas, this technology could prove invaluable in multiple applications including aircraft cabin liners, school buses and other vehicles, industrial environments, and building construction.",
            "LEW-TOPS-109",
            "aeronautics",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-109\/iStock-657048520_LEW-19284-1_low-flying-plane_1388x1050-300dpi.jpg",
            "",
            8.597321
        ],
        [
            "59fa109b9600022a4d1c7753",
            "LAR-TOPS-205",
            "Ultra-High Temperature Displacements and Strain Measurement",
            "NASA Langley Research Center has developed an optical method for detecting displacements and strains at ultra-high temperatures during thermo-mechanical testing. This innovation will provide displacement and strain measurements in high temperature applications where conventional measurements technologies cannot physically survive. The measurement system has operated in laboratory environments in excess of 2,800 degrees Fahrenheit.",
            "LAR-TOPS-205",
            "sensors",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-205\/Engine2.jpg",
            "",
            8.398609
        ],
        [
            "5beffc5a47251902e7571f91",
            "LEW-TOPS-128",
            "SiC-Based Microstructures for Sensors",
            "Innovators at NASA's Glenn Research Center have developed ultra-thin silicon carbide (SiC) microstructures that enable highly sensitive pressure sensors that are bio-compatible. The novel method of fabricating these microstructures, Dopant Selective Reactive Ion Etching (DSRIE), allows for structures as thin as 2 microns to be achieved, while allowing multifunctional sensors to be fabricated on a single SiC wafer. For the first time, it is possible to batch-fabricate ultra-thin SiC diaphragms that can sense very low pressures, enabling pressure sensors that can measure sub-psi pressures. This faster process makes it easier and less costly to produce complex, advanced semiconductors that are fully functional at temperatures greater than 600&deg;C. This technique enables a new generation of SiC-based microelectromechanical systems (MEMS) and nanoelectromechanical systems (NEMS) such as accelerometers, pressure sensors, and biosensors.",
            "LEW-TOPS-128",
            "sensors",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-128\/iStock-961805064_LEW-17170_V8-Engine-Rendering-Explosions-Sparks_1388x1050-300dpi.jpg",
            "",
            8.317265
        ],
        [
            "5a8bf993960002d136755ba4",
            "LEW-TOPS-76",
            "Data Transfer for Multiple Sensor Networks",
            "At extreme temperatures, few electronic components are available to support intelligent data transfer over a common, linear combining medium such as wire or the airwaves.  NASA Glenn's innovation allows the operating frequency of a sensor instrument to be time variant because the sensor is part of the frequency generator's transfer function. Each instrument associated with a sensor imparts a unique (orthogonal) signature onto the continuous output of that sensor. As a consequence, the outputs of numerous instruments may be simultaneously superimposed upon one another via a linear combining medium and then be separated at a common receiving node in a more temperate location using any number of linear source separation techniques. A listening node, using various techniques, can pick out the signal from a single sender, if it has unique qualities; e.g., a \"voice.\" This technique is analogous to the human brain recognizing and following a single conversation in a party full of people talking and other distracting noises.",
            "LEW-TOPS-76",
            "instrumentation",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-76\/iStock_000050427638_LEW-19148-1_oil-pump_1388x1050-300DPI.jpg",
            "",
            8.220701
        ],
        [
            "5ece2cb540205c0c2819e334",
            "MFS-TOPS-103",
            "Defect-Free Paraffin Fuel Manufacturing",
            "Innovators at the Marshall Space Flight Center (MSFC) developed a novel paraffin-based fuel and manufacturing process for use in hybrid rocket engines for the Mars Ascent Vehicle (MAV).  The fuel has a suitable regression rate and additives for additional strength and survivability.  The process addresses the manufacturing issues with larger-diameter paraffin fuel grains.  The manufacturing process employs a novel cooling protocol to result in intact monolithic fuel grains at scale for use in propulsion systems with hybrid rocket engines. Engineers are investigating the use of this paraffin-based fuel specifically for MAV because the fuel has a wider storage temperature range than other propellants.  The paraffin based fuel survives in low temperatures (-100 C), freeing up energy for other vehicle or mission purposes.  Challenges arose with manufacturing these fuel grains due to the &#126;15&#37;  volume liquid to solid phase change, different density ingredients and inherent brittle nature of paraffin wax. Prior manufacturing efforts lead to problems with cracked, unusable fuel grains, and the inability to produce at the scale needed for use in propulsion systems.",
            "MFS-TOPS-103",
            "propulsion",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-103\/front__1_-convert.jpg",
            "",
            7.870134
        ],
        [
            "59fa091e9600022b4d832e95",
            "LAR-TOPS-117",
            "Hybrid Flow Control Method for Simple Hinged Flap High-Lift System",
            "NASA's Langley Research Center has created a novel process that significantly improves the effectiveness of high-lift devices on aircraft wings by utilizing a hybrid concept of both sweeping jet (SWJ) actuators for active flow control (AFC) and adaptive vortex generators (AVGs) for passive flow control. High-lift technology re-shapes aircraft wings for more lift during takeoff and landing. Conventional high-lift devices are complex and employ a significant number of parts. In addition, these complex mechanical high-lift systems (e.g., Fowler flap mechanisms) often protrude externally under the wings, resulting in increased cruise drag. Simple hinged flaps are preferable high-lift devices for low-drag cruise performance, but they are vulnerable to flow separation at high flap deflections for both trailing edge and leading edge applications.  This innovation achieves higher flap deflections without flow separation while minimizing the pneumatic power requirement of AFC.",
            "LAR-TOPS-117",
            "aeronautics",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-117\/front image.jpg",
            "",
            7.863248
        ],
        [
            "5a8bfb2a960002d3369c215e",
            "LEW-TOPS-32",
            "How to Train Shape Memory Alloys",
            "Shape memory alloys (SMAs), sometimes known as \"smart metals,\" provide a lightweight, solid-state alternative to conventional actuators and switches, such as hydraulic, pneumatic, or motor-based systems. To function properly, SMAs must be \"trained\" to return to a previous form when heated, and innovators at NASA's Glenn Research Center have developed a remarkable new method of completing this training at a fraction of the time and cost of conventional training techniques. Glenn's technique uses mechanical cycling, rather than more complicated and time-consuming thermal cycling, to train SMAs before implementation. In addition, this new approach to training allows SMAs to be applied to complex geometric components, so that they may be used in a broader number of applications.",
            "LEW-TOPS-32",
            "materials and coatings",
            "",
            "",
            "",
            "GRC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LEW-TOPS-32\/iStock_000026590418_LEW-18594-1_robotic-arm_1388x1050-300DPI.jpg",
            "smart materials",
            7.8261876
        ],
        [
            "59fa028f9600022b4d10d84f",
            "LAR-TOPS-12",
            "Low-Profile Wireless Sensor",
            "NASA's Langley Research Center researchers have developed\na wireless low-profile sensor that uses a magnetic field response\nmeasurement acquisition system to provide power to the\nsensor and to acquire physical property measurements from\nit. Unique to this sensor is the shape of the electrical traces\nthat eliminates the need for separate inductance, capacitance,\nand connection circuitry. This feature gives the sensor a\nsmaller circuit footprint to enable a smaller, flexible, and easy\nto fabricate sensor package. The shape of the electrical trace\ncan be readily modified to sense different physical properties.\nAlso, arranging multiple low-profile sensors together can\npermit the wireless data acquisition system to read the\nresponses from all the sensors by powering just one of them.",
            "LAR-TOPS-12",
            "sensors",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-12\/TOP272_front.jpg",
            "",
            7.8261876
        ],
        [
            "59fa05cb9600022b4dea2185",
            "LAR-TOPS-29",
            "Magnetic Field Response Measurement Acquisition System",
            "NASAs Langley Research Center researchers have developed a measurement acquisition system that uses magnetic fields to provide power to sensors and to acquire physical property measurements from them. Unlike traditional acquisition devices, this system has the ability to make multiple measurements of different, non-related physical properties without the constraint of a limited number of data acquisition channels. Winner of the prestigious R&D 100 award, this technology has been demonstrated with a leading aircraft landing gear manufacturer to wirelessly measure the fluid levels in landing gear shock struts. In addition to fluid level, rotation, temperature, material phase changes, proximity, position, and volume measurements have all been demonstrated.",
            "LAR-TOPS-29",
            "sensors",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-29\/Front_NP-2014-08-1109-HQ.jpg",
            "",
            7.8261876
        ],
        [
            "55ce668f95dd5ec04231ee23",
            "MFS-TOPS-40",
            "Nested Focusing Optics for Compact Neutron Sources",
            "NASA's Marshall Space Flight Center has developed novel neutron grazing incidence optics for use with small-scale portable neutron generators. The technology was developed to enable the use of commercially available neutron generators for applications requiring high flux densities, including high performance imaging and analysis. Nested grazing incidence mirror optics, with high collection efficiency, are used to produce divergent, parallel, or convergent neutron beams. Ray tracing simulations of the system (with source-object separation of 10m for 5 meV neutrons) show nearly an order of magnitude neutron flux increase on a 1-mm diameter object. The technology is a result of joint development efforts between NASA and MIT researchers seeking to maximize neutron flux from diffuse sources for imaging and testing applications.",
            "MFS-TOPS-40",
            "optics",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-40\/Front_NP-2014-08-1090-HQ.jpg",
            "",
            7.7835665
        ],
        [
            "5ece2c7140205c087f292874",
            "NPO-TOPS-59",
            "High-Performance, Lightweight, Easy-to-Fabricate Heat Exchanger",
            "Researchers at NASA's Jet Propulsion Laboratory (JPL) have developed an advanced heat exchanger that addresses problems typically associated with metal-based systems. Unlike typical metal heat exchangers, which suffer from high thermal expansion and high density, JPL's innovation offers several improved properties. Its lightweight, high heat flux design offers a low coefficient of thermal expansion (CTE)&#8212;and therefore low expansion characteristics&#8212;and reduces the pressure drop during heat transfer. The design can handle high-temperature gases (up to 650 &#176;C). This technology has undergone successful preliminary testing. Developed for an aircraft exhaust energy recovery application, the system meets the requirements of high-temperature, high-specific-power thermoelectric generators and other energy recovery systems for industrial, automotive, military, and space applications.",
            "NPO-TOPS-59",
            "power generation and storage",
            "",
            "",
            "",
            "JPL",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/NPO-TOPS-59\/NPO-50566-1_MiniChannelGraphiteHeatExchanger-1380x1050.jpg",
            "",
            7.6252065
        ],
        [
            "55ce671195dd5ec04231ee2f",
            "MFS-TOPS-6",
            "Aluminum Alloy for High Temperature Applications",
            "NASA's Marshall Space Flight Center originally developed a high-performance piston alloy to meet U.S. legislative restrictions on vehicular exhaust hydrocarbon emissions. NASA 398 aluminum alloy exhibits excellent tensile and fatigue strength at elevated temperatures. NASA 398 alloy also offers superior wear resistance, surface hardness, dimensional stability, and lower thermal expansion compared to conventional aluminum alloys. NASA 398 has been used in mass production and has enabled award-winning and innovative commercial products, and the NASA Marshall Technology Transfer Office is seeking new licensees that may also benefit from its adoption.",
            "MFS-TOPS-6",
            "materials and coatings",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-6\/Front_NP-2014-08-1154-HQ.jpg",
            "advanced composites",
            7.5883927
        ],
        [
            "564834af95dd5e660772eb3b",
            "MFS-TOPS-49",
            "Digital Machine Control Electronics",
            "NASA's Marshall Space Flight Center offers a suite of novel technologies for digital control of electronic machinery. Originally developed for the autonomous assembly of modular space structures, the base innovations in the suite can improve gap sensors and absolute position sensors. They sense position and proximity and can also wirelessly communicate information to drive switching and stepper motor operations. The technologies can benefit a broad range of industrial robotics applications, and they can be combined to perform a variety of functions. Additional components in the suite can be incorporated into the base technologies to perform other sensor functions and serve as short-range antennas and close-proximity transmitters and receivers. The NASA innovations are self-calibrating and have embedded integrity-monitoring functions for assured position and proximity readings.",
            "MFS-TOPS-49",
            "robotics automation and control",
            "",
            "",
            "",
            "MSFC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/MFS-TOPS-49\/TOA_MSFC_Alhorn_5web_converted.jpg",
            "",
            7.1636167
        ],
        [
            "5bdd8b154725195e30379a19",
            "LAR-TOPS-115",
            "Handheld Spectrometer",
            "NASA's Langley Research Center has built a very small\nspectrometer by integrating a differential linear Fresnel lens\nonto an imaging chip. NASA is using the lens\/chip in a very\nsmall spectrometer that will be mounted on tires of a rover to\nanalyze soil on the moon or Mars. The spectrometer is useful\nfor space-constrained applications. It combines good resolution\nwith small size and potentially reduced manufacturing costs.\nThe ultra-compact integration of the spectrometer is enabled by\nthe use of an optimized Fresnel grating. Since Fresnel imaging\nworks as valid focal points of spectrum within the short optical\ndistance, the shorter optical path length required (compared to a\ntraditional Fraunhofer lens) enables the small size. Further, the\nevolution to a differentially linear Fresnel lens (instead of circular\nFresnel) avoids the need for aperture slit driver electronics and\nmoving parts, and simplifies manufacturing. The linear Fresnel\ngratings lend themselves to mass production via plastic injection\nmolding or nano-imprint lithography. NASA is seeking partners\nto develop the spectrometer for commercial applications.",
            "LAR-TOPS-115",
            "sensors",
            "",
            "",
            "",
            "LARC",
            "https:\/\/technology.nasa.gov\/t2media\/tops\/img\/LAR-TOPS-115\/TOP127_front.jpg",
            "",
            6.8968053
        ]
    ],
    "count": 54,
    "total": 54,
    "perpage": 10,
    "page": 0
}